//пакет конфигурации 

//---------------------КНОПКИ\АЦП------------------------------
#define DIR_LEFT 4  // кнопка влево либо реле при спуске
#define DIR_RIGHT 3 // кнопка вправо либо реле при подъеме
#define ADC_INPUT 0 // аналоговый вход под потенциомметр 

//-------------НАСТРОЙКА ВХОДОВ ДЛЯ ДРАЙВЕРА ШД--------------------
#define PULSE 8  // пин выход на драйвер
#define DIR 9    // пин направление вращения 
#define ENABLE 5 // пин вкл\откл двигателя

#define MAX_SPEED 10000 //максимальная скорость в виде шаг/сек
#define MIN_SPEED 0     //минимальная скорость в виде шаг/сек
 
